app/Http/Controllers/Auth/AuthenticatedSessionController.php

select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 38)
select * from `general_website_settings` where `general_website_settings`.`id` = 1 limit 1
---
    public function create()
    {
        $categories_nested = Category::whereNull('parent_id')
            ->with('children')
            ->orderby('name', 'asc')
            ->get();

        $general_website_settings = GeneralWebsiteSettings::find(1)->first();