app/Helpers/Helpers.php

    public static function nb_products_database()
    {
        return count(Product::all());
---
select * from `products`

    public static function nb_products_of_category($category_id)
    {

        $category_target = Category::where('id', $category_id)->first();
---
select * from `categories` where `id` = 7 limit 1