app/Http/Controllers/CartController.php

select * from `general_website_settings` where `general_website_settings`.`id` = 1 limit 1
select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 38)
---
    public function __construct()
    {
        SeoController::metaTag();
        $this->general_website_settings = GeneralWebsiteSettings::find(1);

        //Category Nested
        $this->categories_nested = Category::whereNull('parent_id')
            ->with('children')
            ->orderby('name', 'asc')
            ->get();

select * from `products` where `products`.`id` = '4' limit 1
select * from `product_variants` where `product_variants`.`id` = '4' limit 1
---
    public function store(Request $request)
    {
        /*  dd($request->all()); */
        $validator = Validator::make(
            $request->all(),
            [
                'variant_id' => 'required',
                'product_id' => 'required',
                'qty' => 'required'
            ],
            [
                'qty.required' => 'The quantity is required',
            ]
        );

        if ($validator->fails()) {
            return response()->json(
                [
                    'response' => false,
                    'message' => 'The quantity is required',
                ]
            );
        }

        $product = Product::findorFail($request->product_id);
        $product_variant = ProductVariant::findorFail($request->variant_id);