app/Http/Controllers/CategoryController.php

    public function categories_all()
    {
        /* Cette variable vide doit exister car si l'on ajoute une subcategory,
        on collecte tous les parent_id pour ouvrir le menu au bon endroit */
        $collect_parent_ids = [];

        $categories = Category::whereNull('parent_id')
            ->with('children')
            ->orderby('name', 'asc')
            ->get();
---
select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 38)