app/Http/Controllers/MusicTrackController.php

select * from `music_tracks` order by `created_at` asc limit 10 offset 0
select count(*) as aggregate from `music_tracks`
---
    public function tracks_all()
    {
        $tracks = MusicTrack::orderBy('created_at', 'asc')->paginate(10);