app/Http/Controllers/ProductController.php

    public function products_all()
    {
        $products = Product::all();
        $digital_files = MultiDigitalFileProduct::all();
---
select * from `products`
select * from `multi_digital_file_products`

    public function clone($id)
    {
       /*  dd($id); */

        // Clone Product
        $product = Product::find($id);
        $copy_product = $product->replicate();
        $copy_product->created_at = Carbon::now();
        $copy_product->save();

        //Clone Product Variant
        $product_variants = ProductVariant::where('product_id', $id)->get();

        if (count($product_variants)) {
            foreach ($product_variants as $variant) {

                // Clone Variant
                $variant_copy = $variant->replicate();
                $variant_copy->product_id = $copy_product->id;
                $variant_copy->created_at = Carbon::now();
                $variant_copy->save();

                // If variant has multi images
                $multi_images_variant = MultipleImageProductVariant::where('product_variant_id', $variant->id)->get();
---
select * from `products` where `products`.`id` = '4' limit 1
select * from `product_variants` where `product_id` = '4'
select * from `multiple_image_product_variants` where `product_variant_id` = 1

        }

        // Clone Product Options
        $product_options = ProductOptionPivot::where('product_id', $id)->get();
---
select * from `product_option_pivots` where `product_id` = '4'