app/Http/Controllers/ProductMaterialController.php

select * from `products` where `products`.`id` = '7' limit 1
select * from `product_options` order by `name` asc
select * from `product_option_pivots` where `product_id` = '7'
select * from `product_variants` where `product_id` = '7' order by `id` asc
select * from `multiple_image_product_variants` where `product_id` = '7'
select * from `weights`
select * from `currencies`
select * from `categories` order by `name` asc
---
    public function edit($id)
    {
        // Product Target
        $product = Product::findorfail($id);

        // Product Options Table
        $options = ProductOption::orderBy('name', 'asc')->get();

        // Product Options Pivot
        $product_options_checked = ProductOptionPivot::where('product_id', $id)->get();

        // Product Variants Table
        $variants = ProductVariant::where('product_id', $id)->orderby('id', 'asc')->get();
        $multiple_img_variants = MultipleImageProductVariant::where('product_id', $id)->get();

        //Product Weight Table
        $weights = Weight::all();

        //Product Currencies Table
        $currencies = Currency::all();

        $categories = Category::orderBy('name', 'asc')->get();