app/Http/Controllers/ProductReviewController.php

    public function reviews_all()
    {
        $reviews = ProductReview::orderBy('created_at', 'desc')->get();
---
select * from `product_reviews` order by `created_at` desc

    public function delete(Request $request)
    {
        /* dd($request->all()); */
        if ($request->delete_checkbox) {
            $checkbox_ids = json_decode($request->delete_checkbox);

            foreach ($checkbox_ids as $id) {
                $product_review = ProductReview::findOrFail($id);
                $product_review->delete();
---
select * from `product_reviews` where `product_reviews`.`id` = '1' limit 1
delete from `product_reviews` where `id` = 1