app/Http/Controllers/ProductOptionController.php

select * from `product_options` order by `name` asc
---
    public function options_all()
    {
        $product_options = ProductOption::orderBy('name', 'asc')->get();

select * from `product_options` where `product_options`.`id` = '1' limit 1
---
    public function update(Request $request)
    {
        /* dd($request->all()); */
        $product_option_update = ProductOption::findorFail($request->option_id);

delete from `product_option_pivots` where `product_option_id` = '1'
select * from `product_options` where `product_options`.`id` = '1' limit 1
delete from `product_options` where `id` = 1
---
    public function delete(Request $request)
    {
        /* dd($request->all()); */
        if ($request->delete_checkbox) {
            $checkbox_ids = json_decode($request->delete_checkbox);

            foreach ($checkbox_ids as $id) {
                // Delete Product Option Pivot
                $product_option = ProductOptionPivot::where('product_option_id', ($id));
                $product_option->delete();

                // Delete Product Option Pivot
                $product_option = ProductOption::find($id);
                $product_option->delete();

select * from `product_variants` where `product_id` = '4' and (`name` like '%/XS/%' and `name` like '%/red/%') limit 1
select * from `multiple_image_product_variants` where `product_variant_id` = 1
---
    public function ajax_option_product(Request $request)
    {
        if ($request->ajax()) {
            $input_values = $request->get('input_values');
            $id = $request->get('id');

            $product_variant = ProductVariant::where('product_id', $id)
                ->where(function ($q)  use ($input_values) {
                    foreach ($input_values as $value) {
                        $q->where('name', 'like', '%/' . $value . '/%');
                    }
                })
                ->first();

            $multi_images_variant = MultipleImageProductVariant::where('product_variant_id', $product_variant->id)->get();