app/Http/Controllers/WebsitePageController.php

select * from `general_website_settings` where `general_website_settings`.`id` = 1 limit 1
select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 38)
---
    public function __construct()
    {
        SeoController::metaTag();
        $this->general_website_settings = GeneralWebsiteSettings::find(1);

        //Category Nested
        $this->categories_nested = Category::whereNull('parent_id')
            ->with('children')
            ->orderby('name', 'asc')
            ->get();

select * from `products` where `hot_deals` = 1 limit 8
select * from `products` where `special_offer` = 1 limit 8
select * from `products` where `special_deals` = 1 limit 8
select * from `products` where `featured` = 1 limit 8
---
    public function home()
    {
        // Checkbox
        $hot_deals_product = Product::where('hot_deals', 1)->limit(8)->get();
        $special_offer_product = Product::where('special_offer', 1)->limit(8)->get();
        $special_deals_product = Product::where('special_deals', 1)->limit(8)->get();
        $featured_product = Product::where('featured', 1)->limit(8)->get();

select * from `products` where `products`.`id` = '4' limit 1
select * from `product_option_pivots` where `product_id` = '4'
select * from `multiple_image_product_variants` where `product_id` = '4'
select * from `product_reviews` where `product_id` = '4'
---
    public function product_details($id)
    {

        $product = Product::find($id);

        // Display Product Options
        $product_options_pivot = ProductOptionPivot::where('product_id', $id)->get();
        $product_options_values = [];

        foreach ($product_options_pivot as $option) {
            $product_options_values[$option->product_option->name] = $option->product_option->value;
        }

        // Case Simple Product, Call Multiple Image
        $multiple_image_simple_product = MultipleImageProductVariant::where('product_id', $id)->get();

        if (!count($multiple_image_simple_product)) {
            $multiple_image_simple_product = '';
        }

        // PRODUCT RATING REVIEW
        $product_review = ProductReview::where('product_id', $id)->get();

select count(*) as aggregate from `product_reviews` where `product_id` = '4'
---
        }

        // Call All Reviews
        $reviews = ProductReview::where('product_id', $id)->orderBy('created_at', 'desc')->paginate($this->paginate_reviews);

select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 38)
---
    public function page_404()
    {
        $title_page = "Page not Found";
        $categories_nested = Category::whereNull('parent_id')
            ->with('children')
            ->orderby('name', 'asc')
            ->get();

select * from `products` order by `selling_price` asc limit 20 offset 0
select count(*) as aggregate from `products`
---
                return $q->paginate($this->paginate_default);
            }
        } else {
            $products = Product::orderBy('selling_price', 'asc')->paginate($this->paginate_default);