app/Http/Controllers/YoutubeVideoController.php

    public function videos_all()
    {
        $youtube_videos = YoutubeVideo::orderBy('created_at', 'asc')->paginate(10);
---
select * from `youtube_videos` order by `created_at` asc limit 10 offset 0
select count(*) as aggregate from `youtube_videos`

    public function delete(Request $request)
    {
        /* dd($request->all()); */
        if ($request->delete_checkbox) {
            $checkbox_ids = json_decode($request->delete_checkbox);

            foreach ($checkbox_ids as $id) {
                $youtub_video = YoutubeVideo::find($id);
                $youtub_video->delete();
---
select * from `youtube_videos` where `youtube_videos`.`id` = '1' limit 1
delete from `youtube_videos` where `id` = 1