app/Models/Category.php

    public function products_of_category($category)
    {
        if ($category->children) {
            $this->collect_ids[$category->name] = $category->id;
            foreach ($category->children as $category) {
                $this->collect_ids[$category->name] = $category->id;
                $this->products_of_category($category);
            }
        }

        return Product::whereIn('category_id', $this->collect_ids)->get();
---
select * from `products` where `category_id` in (7)